{
    "Case 3": {
        "Two Men Sought in a Robbery Investigation, Steeles Avenue East and Don Mills Road Area, Images Released": " The Toronto Police Service is requesting the public’s assistance with identifying two men wanted in a Robbery investigation. On Wednesday, January 31, 2024, at approximately 1 a.m., police responded to a call for Robbery in the Steeles Avenue East and Don Mills Road area. It is reported that:  the two male suspects followed the victim onboard a TTC bus the suspects then approached the victim, and assaulted him during the assault, the suspects attempted to steal the victim's cellphone the suspects exited the bus and fled on foot the victim sustained minor injuries  Suspect #1 is described as being a male, 25-30 years old, 6'2\", 220 lbs., with a stocky build. He was wearing a black hooded sweater, grey cargo pants, a black ski mask, tan coloured boots, and carrying a black bag. Suspect #2 is described as being a male, 5'9\", 160 lbs., with a medium build, and \"chin strap\" facial hair. He was wearing a black \"Moose Knuckle\" jacket, black pants, black shoes, and carrying a brown paper bag. Images have been released. Anyone with information is asked to contact police at 416-808-3300, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 4": {
        "Man Arrested in Threatening Investigation, University Avenue and Gerrard Street West area": " The Toronto Police Service is making the public aware of an arrest made in a Threatening investigation. It is alleged that:  on Wednesday, February 14, 2024, the accused called Toronto police to express frustration towards people demonstrating in front of a hospital the accused threatened to attend the hospital to harm the demonstrators   On Friday, February 16, 2024, Paul Scoffield, 49, of Simcoe County, was arrested and charged with:  Uttering Threats Cause Death   He appeared in court at the Toronto Regional Bail Centre, 2201 Finch Avenue West, on Friday, February 16, 2024, at 10 a.m., in room 206. Anyone with information is asked to contact police at 416-808-3500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 6": {
        "Suspected Hate-Motivated Threatening Investigation, Bathurst Street and Wilson Avenue area, Man Arrested": " The Toronto Police Service is making the public aware of an arrest made in a suspected hate-motivated Threatening investigation. On Wednesday, January 24, 2024, at approximately 4:15 p.m., Toronto Police received a call for Threatening in the Bathurst Street and Wilson Avenue area. It is alleged that:  the accused was walking in the area of a school the accused made several anti-Semitic threats towards students and families  On Thursday, February 15, 2024, Toronto Police arrested Mark Encarnacion, 23, of Toronto. He has been charged with:  Utter Threats Cause Disturbance  He is scheduled to appear in court at the Ontario Court of Justice, 10 Armoury Street, on Tuesday, March 26, 2024, at 2 p.m., in room 201. This investigation is being treated as a suspected hate-motivated offence. Anyone with information is asked to contact police at 416-808-3500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. When suspected hate-motivated offences are reported to police, the investigation could be led by a Divisional investigator with the support of the Hate Crime Unit (HCU), or in some cases, will be investigated exclusively by the HCU. If it is alleged a criminal offence was committed (such as assault or mischief) and it is believed to have been motivated by bias, prejudice or hate, the officer-in-charge may consult with the Crown. If a person is charged and convicted of the offence, the Judge will take into consideration hate as an aggravating factor when imposing a sentence. Wilful promotion of hatred and advocating genocide are hate propaganda (hate speech) offences which require the Attorney General’s consent to lay charges. These charges are often laid at a later time. "
    },
    "Case 9": {
        "Suspect to be Identified in a Stabbing Investigation, Wilson Subway Station, Images released": " The Toronto Police Service is requesting the public's assistance identifying a suspect wanted in a Stabbing Investigation. On Thursday, February 15, 2024, at 5:29 p.m., officers received a call for an Assault with a Weapon at Wilson Subway Station. It is reported that:  a 52-year-old man was exiting the subway at Wilson Station the man became involved in an altercation on the subway platform with a female youth and her male companion the victim and suspects were unknown to each other during the altercation, the victim was physically assaulted and was stabbed the female youth was arrested by officers at the scene the male suspect fled in a north-east direction along Wilson Avenue towards Wilson Heights Boulevard the victim was transported to hospital at the hospital, the victim's injuries were deemed to be non-life-threatening  The suspect is described as wearing a black puffy winter jacket, black hooded sweater, black face-covering, slim charcoal ripped jeans, and white/grey high-top \"Jordan\" shoes. Images of the suspect have been released. The female youth *14, of Toronto, is charged with:  Assault Assault with a Weapon Aggravated Assault Fail to Comply- Undertaking  The youth attended court at the Ontario Court of Justice, 10 Armoury Street, on Friday, February 16, 2024, at 10 a.m., in room 606. Anyone with information on the whereabouts of the male suspect is asked to contact police at 416-808-3200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. **Please refer to Section 110, Subsection 1, of the YCJA: 110. (1) Subject to this section, no person shall publish the name of a young person, or any other information related to a young person, if it would identify the young person as a young person dealt with under this Act.*** "
    },
    "Case 11": {
        "Suspect to be identified in an Attempt Murder Investigation, Bloor Street West and Margueretta Street, Images Released": " The Toronto Police Service is requesting the public's assistance identifying a man wanted in an attempt murder investigation. On Monday, February 12, 2024, at approximately 12:15 a.m., officers attended a call for an assault in progress n the area of Bloor Street West and Margueretta Street. It is reported that:  there was an altercation between two men on Margueretta Street one man was assaulted and rendered unconscious the other man continued to assault the unconscious man a bystander tried to stop the assault and call police, but the male continued to assault the unconscious man before he fled the area the victim was taken to hospital with life-threatening injuries  The suspect is described as 5'10\", 26-32-years-old, medium build, slicked back black hair with the sides of the head shaved short, and has a thin black goatee. He was wearing black rimmed glasses, a black puffy jacket with a hood, black pants, and black/white shoes. Police are also looking for the vehicle that the suspect was seen in earlier that evening, described as a 2008-2012 dark blue or black Ford Escape with a black roof rack and aluminum rims. Images have been released. If located, do not approach and call 9-1-1 immediately. Anyone with information is asked to contact police at 416-808-1100, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 14": {
        "Man Wanted in Assault Investigation, Bathurst Street and Fort York Boulevard, Image released": " The Toronto Police Service is requesting the public’s assistance locating a man wanted in an Assault Investigation. It is reported that:  on Monday, February 12, 2024, the suspect and the victim got into an argument in the Bathurst Street and Fort York Boulevard area a physical confrontation ensued the suspect, armed with a knife, made threats towards the victim  It is further alleged that:  the man is wanted on previous warrants  The suspect has been identified as Tristan Brugiroux, 29, of no fixed address. He is wanted for:  Assault Causing Bodily Harm two counts of Assault two counts of Uttering Threats Assault with a Weapon Forcible Confinement Choking  He is described as 5’7”, with a medium build and brown hair. An image has been released. If located, do not approach and call 9-1-1 immediately. Anyone with information is asked to contact police at 416-808-1400, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 16": {
        "Personal Injury Collision #10/2024, Bellamy Road North and Cedar Brae Boulevard": " On Sunday, February 11, 2024, at 5:30 p.m., police responded to a report of a personal injury collision involving a single motor vehicle in the Bellamy Road North and Cedar Brae Boulevard area. It is reported that:  a 22-year-old man was driving a 2009 Hyundai Sonata northbound on Bellamy Road North at high speeds for reasons unknown, the vehicle crossed into the southbound lanes, left the roadway, and struck a house the driver was taken to hospital with life-threatening injuries.  The investigation is ongoing by members of Traffic Services. Police are asking local residents, businesses, and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 17": {
        "Homicide #6/2024, Weston Road and Lawrence Ave West, Edwin John Redmond, 27, Two Men Arrested, One Man Wanted, Image released": " The Toronto Police Service has arrested two men in a Homicide investigation and are seeking the public’s assistance locating an outstanding suspect. On Saturday, February 10, 2024, at approximately 5:48 a.m., police responded to a call for an assault in the Weston Road and Lawrence Avenue West area. It is alleged that:  there were reports of a fight in an apartment building officers attended and located the victim with significant injuries the victim was pronounced deceased on scene  The victim has been identified as Edwin John Redmond, 27, of Toronto. On Saturday, February 10, 2024, Zakkaria Wardere, 27, of Toronto, was arrested and charged with:  Second Degree Murder  He was scheduled to appear at the Ontario Court of Justice, 2201 Finch Avenue West, on Sunday, February 11, 2024, at 10 a.m., in room 105. On Tuesday, February 13, 2024, Ninos Khoshaba, 49, of Toronto, was arrested and charged with:  Second Degree Murder  He was scheduled to appear at the Ontario Court of Justice, 2201 Finch Avenue West, on Wednesday, February 14, 2024, at 10 a.m., in room 105. The outstanding suspect has been identified as Liban Mohamud, 42, of Toronto, who is wanted on a Canada-Wide Warrant in the First for:  Second Degree Murder  An image of Liban Mohamud has been released. If located, do not approach and call 9-1-1 immediately. Anyone with information is asked to contact police at 416-808-7400, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 18": {
        "Suspect Sought in Assault with a Weapon Investigation, Oak Park Avenue and Wallington Avenue area": " The Toronto Police Service is requesting the public’s assistance identifying a suspect sought in an Assault with a Weapon investigation. On Monday, January 29, 2024, at approximately 9:36 a.m., police responded to a call for a stabbing in the Oak Park Avenue and Wallington Avenue area.  It is reported that:  the victim and suspect got into a verbal altercation the suspect attempted to hit the victim with a rock, and then used a piece of wood to hit the victim the suspect had a small white terrier with brown spots with him the suspect then fled the area the victim sustained non-life threatening injuries  The suspect is described as male, 18-19 years old, 5'9\", with a slim build. An image has been released. Anyone with information is asked to contact police at 416-808-5500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 20": {
        "Man Identified in Assault with a Weapon Investigation, Pape Subway Station, Update": " The Toronto Police Service would like to thank the media and the public for their assistance identifying a man wanted in an Assault with a Weapon investigation. On Sunday, January 14, 2024, police were called for an assault at Pape Subway Station. See previous news release. The man has been identified as Robert Olah, 44, of Toronto. Olah is being held and is before the courts on other matters. The investigation remains ongoing.  Anyone with information is asked to contact police at 416-808-5500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 22": {
        "Youth Arrested in three Carjacking Investigations, Finch Avenue East and Midland Avenue and, Finch Avenue East and Don Mills Road area": " The Toronto Police Service is making the public aware of an arrest made in three Carjacking investigations. On Thursday, December 28, 2023, at approximately 11:17 pm, police responded to a call for a Carjacking in the Finch Avenue East and Midland Avenue area. It is alleged that:  the accused approached the victim while she was sitting in her vehicle he opened the driver side door and pulled the victim out of the vehicle while holding something in his hand the accused then fled the scene with the victim's vehicle the victim did not suffer any injuries  On Monday, January 1, 2024, at approximately 5:46 pm, police responded to a call for a Suspicious Incident in the Finch Avenue East and Midland Avenue area. It is further alleged that:  the victim and her two children exited a restaurant and were walking to their vehicle the accused approached the victim as she was putting her children into her vehicle he made verbal demands and pointed bear spray at her and her children the victim screamed and attracted people in the area the accused fled in a vehicle the victim suffered minor injuries  On Thursday, January 4, 2024, at approximately 12:18 a.m., police responded to a call for a Carjacking in the Finch Avenue East and Don Mills Road area. It is further alleged that:  a man and woman were returning to their vehicle the accused approached the man from behind and made demands for the vehicle keys the accused sprayed the man with bear spray multiple times and took the keys the accused then fled the scene in the man's vehicle the man suffered minor injuries  On Saturday, February 10, 2024, the accused was arrested by members of the OPP Toronto Detachment in the Highway 401 and Weston Road area on an unrelated matter. Members of the Provincial Car Jacking Task Force (PCJTF) were contacted and took custody of the accused once he was charged and released by the OPP. On Saturday, February 10, 2024, a male youth, 17-years-old*, of Toronto, was arrested and charged with:  Robbery two counts of Robbery with Offensive Weapon  three counts of Disguise with Intent  two counts of Possession of Property Obtained by Crime  three counts of Conspiracy to Commit an Indictable Offence   He was scheduled to appear in court at the Ontario Court of Justice, 10 Armoury Street, on Sunday, February 11, 2024, at 11 a.m., in room 107. Anyone with information is asked to contact police at 416-808-7350, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. **Please refer to Section 110, Subsection 1, of the YCJA: 110. (1) Subject to this section, no person shall publish the name of a young person, or any other information related to a young person, if it would identify the young person as a young person dealt with under this Act.*** About the Provincial Carjacking Joint Task Force (PCJTF) As a result of the rising incidents of violence related to auto crimes across the Greater Toronto Area (GTA), local police services have combined resources and established a Provincial Carjacking Joint Task Force (PCJTF) to further co-ordinate law enforcement efforts in combating these crimes. This collaborative approach aims to disrupt the networks responsible for violent and high-risk auto thefts and maximize enforcement efforts against criminal organizations. Co-led by the Toronto Police Service and the Ontario Provincial Police, the task force is a collaboration between police services from across the GTA, including York Regional Police, Halton Regional Police Service, Durham Regional Police Service, Peel Regional Police, and other external agencies, including Criminal Intelligence Service of Ontario. Click here for more information about the PCJTF. "
    },
    "Case 23": {
        "Sexual Assault Alert, Yonge Street and Eglinton Avenue West area, Man Arrested, Image released": " The Toronto Police Service is notifying the public of an arrest made in a Sexual Assault investigation. Between Sunday, January 14, 2024, and Sunday, February 11, 2024, police responded to multiple calls for Sexual Assaults in the Yonge Street and Eglinton Avenue West area. It is alleged that:  at various times and locations within the area, a man approach women walking by the man then sexually assaulted the women to date, three women have come forward, one reporting she was sexually assaulted by the man on two separate days  Jahmore Azziz Walker-White, 31, of Toronto, has been arrested and charged with:  five counts of Sexual Assault five counts of Fail to Comply with Probation Criminal Harassment  He is scheduled to appear in court at Toronto Regional Ball Centre, 2201 Finch Avenue West, on Tuesday, February 13, 2024, at 10 a.m., in room 106. An image has been released. Police believe there may be other victims. Anyone with information is asked to contact police at 416-808-5300, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. A sexual assault is any form of unwanted sexual contact. It includes, but is not limited to, kissing, grabbing, oral sex and penetration. To learn more about sexual assault, including how to report a sexual assault or get support in the community, please visit YourChoice.to. "
    },
    "Case 26": {
        "Homicide #5/2024, Lake Shore Boulevard West and Lower Spadina Avenue area, Matthew Crosby, 46": " The Toronto Police Service is making the public aware of a Homicide investigation. On Thursday, January 11, 2024, at approximately 8:20 p.m., police responded to a call for stabbing in the Lake Shore Boulevard West and Lower Spadina Avenue area. It is reported that:  an argument occurred between the victim and suspect which turned physical the victim was stabbed life-saving measures were performed and the man was transported to hospital  On Friday, February 9, 2024, the victim succumbed to his injuries at the hospital and was pronounced deceased. The victim has been identified as Matthew Crosby, 46, of Toronto. An image has been released. Investigators are asking witnesses, or anyone who was driving in the area at the time and has dash-camera or video surveillance to contact police. Anyone with information is asked to contact police at 416-808-7400, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 27": {
        "Fatal Collision #5/2024, Morningside Avenue and Milner Avenue area": " The Toronto Police Service is requesting the public’s assistance with an investigation into a fatal motor vehicle collision. On Friday, February 9, 2024, at 9:35 p.m., police received a report of a personal injury collision involving a pedestrian and motor vehicle in the  Morningside Avenue and Milner Avenue area.  It is reported that:  a 22-year-old man was operating a Kia Rio motor vehicle and was travelling southbound on Morningside Avenue a 66-year-old pedestrian was crossing from the east side to the west side of Morningside Avenue the driver of the Kia Rio struck the pedestrian the pedestrian was transported to hospital with life-threatening injuries the driver remained on scene the pedestrian later succumbed to his injuries  The investigation is ongoing by members of Traffic Services. Police are asking local residents, businesses, and drivers, who may have security or dash camera footage of the area or witnessed the event, to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 28": {
        "Man Wanted in Assault with a Weapon Investigation, Pape Subway Station": " The Toronto Police Service is requesting the public’s assistance locating a man wanted in an Assault with a Weapon investigation. On Sunday, January 14, 2024, police were called for an assault at Pape Subway Station. It is alleged that:  at approximately 9:45 p.m., a 19-year-old man was westbound on the Bloor-Danforth line approaching Pape Subway Station the suspect struck the man from behind with a wooden object the man was helped off the train by other passengers at Pape Station while the suspect remained on board the victim and suspect were not known to one another  The suspect is described as male, 35-40 years old, 5’8, with black hair and full black beard. He was wearing a black winter jacket, beige-yellow zippered sweater, black pants, and black shoes. An image of the suspect has been released. Anyone with information is asked to contact police at 416-808-5500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 30": {
        "Man Arrested for Assaulting a Toronto Parking Enforcement Officer, Grand Trunk Crescent and Bremner Boulevard": " The Toronto Police Service is making the public aware of an arrest in an Assault investigation. On Wednesday February 7, 2024 at 5:40 p.m., police responded to a call for an incident in the Grand Trunk Crescent and Bremner Boulevard area. It is alleged that:  a Parking Enforcement Officer (PEO) was enforcing the No Standing by-law in the area a driver got out of his vehicle and became verbally abusive towards the PEO the driver assaulted the PEO and grabbed his handheld ticket device the driver returned to his vehicle with the handheld ticket device and drove away the driver then returned and continued to verbally abuse the PEO police attended and conducted an investigation the driver was arrested nearby  Younis Hassan, 33, of Toronto, was charged with:  Assault Peace Officer Theft - Under $5000  He is scheduled to appear in court on Thursday, March 14, 2024, at 2 p.m., at the Ontario Court of Justice, 10 Armory Street, in courtroom 202. Anyone with information is asked to contact police at 416-808-1600, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 31": {
        "Man Wanted in Assault Causing Bodily Harm and Forcible Confinement Investigation, Eglinton Avenue West and Kipling Avenue area, Image Released": " The Toronto Police Service is requesting the public’s assistance with an Assault Causing Bodily Harm and Forcible Confinement investigation. On Tuesday, February 6, 2024, at approximately 5:30 p.m., police responded to a call for an assault in the Eglinton Avenue and Kipling West area. It is alleged that:  on Tuesday, July 4, 2023, the suspect assaulted the victim in the Yonge Street and Sheppard Avenue East area on Tuesday, February 6, 2024, the suspect assaulted the same victim in the Eglinton Avenue and Kipling West area the suspect uttered a death threat to the victim while preventing the victim from leaving the suspect then stole the victim's cell phone and fled in a black SUV vehicle  Eddy Pico, 40, of Toronto, is wanted for:  Assault Causing Bodily Harm Forcible Confinement Extortion two counts of Assault Intimidation by Violence Uttering Death Threats Assault/Choking Theft - Under $5000  He is described as 5'5\", with a thin build and black hair. An image has been released. If located, do not approach and call 9-1-1 immediately. Anyone with information is asked to contact police at 416-808-2300, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 32": {
        "Man Arrested in Assault Investigation, Bloor Street West and Indian Grove area, Images released": " The Toronto Police Service is making the public aware of an arrest made in an Assault investigation. On Friday, January 19, 2024, at approximately 2:42 p.m., police responded to a call for an assault in the  Bloor Street West and Indian Grove area. It is alleged that:  the victim entered a store in the area the victim was approached by the suspect the suspect assaulted the victim, causing serious injuries the suspect fled the scene the victim and suspect were not known to one another  Through investigation, members of 11 Division were able to identify the accused as Andrew Gonsalves, 31, of Toronto. On Wednesday, February 7, 2024, he was arrested and charged with:  Assault Cause Bodily Harm Breach Probation  He appeared at Ontario Court of Justice, 10 Armoury Street, on Wednesday, February 7, 2024, at 10 a.m., in room 301. Investigators believe there may be other victims. The suspect is described as male, 5’11, thin build and wearing dark clothing. Images of the accused have been released. Anyone with information is asked to contact police at 416-808-1100, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 34": {
        "Suspected Hate-Motivated Robbery Investigation, Danforth Avenue and Warden Avenue area, Man Arrested": " The Toronto Police Service is making the public aware of an arrest made in a suspected hate-motivated Robbery investigation. On Sunday, February 4, 2024, at 1:47 p.m., Toronto Police received a call for a Robbery in the Danforth Avenue and Warden Avenue area. It is alleged that:  the accused entered a store and began making anti-Muslim comments toward an employee  a customer approached the accused, telling him to stop bothering the employee the accused then started making anti-Muslim comments toward the customer the accused assaulted the customer, causing her to fall to the ground once she fell, the accused grabbed her cell phone and fled the store  Through investigation, officers were able to identify the accused as Tim Rogers, 49, of Toronto.  He was arrested and charged with:  Robbery with Violence two counts Possession of Property Obtained by Crime Under $5000  He was scheduled to appear in court at the Toronto Regional Bail Centre, 2201 Finch Avenue West, on Monday, February 5, 2024, at 10 a.m., in room 103. This investigation is being treated as a suspected hate-motivated offence. Anyone with information is asked to contact police at 416-808-3500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. When suspected hate-motivated offences are reported to police, the investigation could be led by a Divisional investigator with the support of the Hate Crime Unit (HCU), or in some cases, will be investigated exclusively by the HCU. If it is alleged a criminal offence was committed (such as assault or mischief) and it is believed to have been motivated by bias, prejudice or hate, the officer-in-charge may consult with the Crown. If a person is charged and convicted of the offence, the Judge will take into consideration hate as an aggravating factor when imposing a sentence. Wilful promotion of hatred and advocating genocide are hate propaganda (hate speech) offences which require the Attorney General’s consent to lay charges. These charges are often laid at a later time. "
    },
    "Case 35": {
        "Homicide #4/2024, Lansdowne Avenue And Bloor Street West area, Issaïh Jünger, 18": " The Toronto Police Service is making the public aware of a Homicide investigation. On Tuesday, February 6, 2024, at approximately 1:28 a.m., police responded to a call for shooting in the Lansdowne Avenue and Bloor Street West area. It is reported that:  the victim was located with trauma to his body life-saving measures were performed and the man was transported to hospital the man succumbed to his injuries at the hospital and was pronounced deceased  The victim has been identified as Issaïh Jünger, 18, of Missisauga. An image has been released. Investigators are asking witnesses, or anyone who was driving in the area at the time and has dash-camera or video surveillance to contact police. Anyone with information is asked to contact police at 416-808-7400, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 36": {
        "Homicide #32/2023, Queen Street East and Carlaw Avenue area, Update, Suspect Identified": " On Wednesday, February 7, 2024, Detective Sergeant Henri Marsman from the Homicide and Missing Persons Unit updated the public on the homicide investigation of Karolina \"Caroline\" Huebner-Makurat, 44 (Homicide #32/2023). A suspect, Ahmed Ali, 19, of Toronto, is being sought on a Canada-wide warrant for manslaughter and robbery with a firearm. Watch the news conference on YouTube. Excerpt from previous news release published on Saturday, July 8, 2023: On Friday July 7, 2023, at 12:22 p.m., the Toronto Police Service received a call for a shooting in the Queen Street East and Carlaw Avenue area. It is reported that:     there was a physical altercation between three males    two of the males brandished handguns and discharged them at each other    the female victim was walking in the area and was struck by a stray bullet    she was transported to hospital where she was later pronounced deceased    the suspects fled the area on foot  The victim has been identified as Karolina Huebner-Makurat, 44, of Toronto. -- Excerpt from previous news release published on Thursday, July 13, 2023: Damian Hudson, 32, of Toronto has been arrested and charged with:  Second Degree Murder  He was scheduled to appear in court at the Toronto Regional Bail Centre, 2201 Finch Avenue West, on Thursday, July 13, 2023 at 10 a.m., in room 106. -- Excerpt from previous news release published Tuesday, August 15, 2023: On Monday, August 14, 2023, a second suspect was arrested. Ahmed Mustafa Ibrahim, 20, of Toronto, has been charged with:  Manslaughter Robbery Fail to Comply with Probation  He was scheduled to appear in court on Tuesday, August 15, 2023, at 10 a.m., at the Toronto Regional Bail Centre, 2201 Finch Avenue West, in courtroom 106. The third suspect involved in the altercation on July 7, 2023, remains outstanding. He is described as:  male, 18-25 years old, average height, slim build, with long hair in a ponytail. He was wearing a black baseball hat, a black North Face hoodie, dark coloured jeans and white shoes.  Suspect image released. Police continue to seek the public's assistance identifying the outstanding suspect.  As a result of further information revealed as part of the ongoing investigation, a fourth person has been arrested. On Monday, August 14, 2023, Khalila Zara Mohammed, 23, of Pickering, was arrested and charged with:  Accessory After the Fact to an Indictable Offence Obstruct Justice  She was scheduled to appear in court on Tuesday, August 15, 2023, at 10 a.m., at the Toronto Regional Bail Centre, 2201 Finch Avenue West, in courtroom 102. -- The Toronto Police Service is requesting the public's assistance locating the third suspect in this Homicide investigation. Ahmed Ali, 19, of Toronto, is wanted on a Canada Wide Warrant for:  Manslaughter Robbery with a Firearm  He is described as being 6'0\" tall, approximately 130 lbs, with a thin build, and long dark hair worn in braids. Images have been released. Anyone with information is asked to contact police at 416-808-7400, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 38": {
        "Suspect Sought in Break and Enter Investigation, Queen Street East and Neville Park Boulevard area, Images Released": " The Toronto Police Service is requesting the public’s assistance identifying a man wanted in a Break and Enter investigation. On Tuesday, February 6, 2024, at approximately 8:12 a.m., police responded to a call for a break and enter in the Queen Street East and Neville Park Boulevard area. It is reported that:  the suspect broke the front door of a business the suspect then gained entry into the building once inside, the suspect took a number of items before fleeing  The man is described as having a medium build with a black beard. He was wearing a black toque, a light coloured hooded jacket, \"Adidas\" track pants, light coloured shoes, and winter gloves. Images have been released. Anyone with information is asked to contact police at 416-808-5500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 39": {
        "Man arrested in a Carjacking Investigation, Steeles Avenue and Markham Road": " The Toronto Police Service is making the public aware of an arrest in a carjacking investigation. On Monday, February 5, 2024, police responded to a carjacking in the Steeles Avenue East and Markham Road area. It is alleged that:  at approximately 7:30 p.m., the victim was sitting inside their vehicle the suspect approached the victim brandishing a firearm and made a demand for her vehicle the victim exited their vehicle and the suspect got in and fled the area a short time later, officers from 42 division located the vehicle with the suspect still inside the suspect was arrested and a replica firearm was recovered the Provincial Carjacking Joint Task Force took carriage of the investigation  Devansh Rajdeep, 24 of Toronto, was charged with:  Robbery while armed with a firearm Disguise with intent Dangerous operation of a conveyance Flight from police Fail to comply Probation Possession of property obtained by crime over $5000  He was scheduled to appear in court at Toronto Bail Court, 2201 Finch Avenue West, on Tuesday, February 6, 2024, at 10 a.m., in room 103. Anyone with information is asked to contact police at 416-808-7350, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. About the Provincial Carjacking Joint Task Force (PCJTF) As a result of the rising incidents of violence related to auto crimes across the Greater Toronto Area (GTA), local police services have combined resources and established a Provincial Carjacking Joint Task Force (PCJTF) to further co-ordinate law enforcement efforts in combating these crimes. This collaborative approach aims to disrupt the networks responsible for violent and high-risk auto thefts and maximize enforcement efforts against criminal organizations. Co-led by the Toronto Police Service and the Ontario Provincial Police, the task force is a collaboration between police services from across the GTA, including York Regional Police, Halton Regional Police Service, Durham Regional Police Service, Peel Regional Police, and other external agencies, including Criminal Intelligence Service of Ontario. Click here for more information about the PCJTF. "
    },
    "Case 40": {
        "Man Arrested in Carjacking Investigation, Mount Pleasant Road and Manor Road area": " The Toronto Police Service is making the public aware of an arrest in a carjacking investigation. On Monday, February 5, 2024, police responded to a call for a carjacking in the Mount Pleasant Road and Manor Road area. It is alleged that:  at approximately 2:10 p.m., the victim was standing outside of their vehicle the suspect approached the victim while holding a sharp object in his hand the suspect made a demand for the victim's car keys the victim complied with his demand and the suspect got into the victim's vehicle the victim called 911 and officers from 53 Division arrived quickly on-scene and arrested the suspect, who was still inside the vehicle  Alexander Berube, 35, of Toronto, has been charged with:  Robbery with an offensive weapon Possession of property obtained by crime under $5000  He was scheduled to appear in court at Toronto Bail Court, 2201 Finch Avenue West, on Tuesday, February 6,2024, at 10 a.m., in room 106. Anyone with information is asked to contact police at 416-808-7350, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. About the Provincial Carjacking Joint Task Force (PCJTF) As a result of the rising incidents of violence related to auto crimes across the Greater Toronto Area (GTA), local police services have combined resources and established a Provincial Carjacking Joint Task Force (PCJTF) to further co-ordinate law enforcement efforts in combating these crimes. This collaborative approach aims to disrupt the networks responsible for violent and high-risk auto thefts and maximize enforcement efforts against criminal organizations. Co-led by the Toronto Police Service and the Ontario Provincial Police, the task force is a collaboration between police services from across the GTA, including York Regional Police, Halton Regional Police Service, Durham Regional Police Service, Peel Regional Police, and other external agencies, including Criminal Intelligence Service of Ontario. Click here for more information about the PCJTF. "
    },
    "Case 41": {
        "Man Arrested in Assault Investigation, Yonge Street and Cranbrooke Avenue area": " The Toronto Police Service is making the public aware of an arrest made in an Assault investigation. On Tuesday, January 30, 2024, at approximately 3:45 p.m., police responded to a call for an assault in the Yonge Street and Cranbrooke Avenue area. It is alleged that:  the victim was walking on the sidewalk along Yonge Street the accused approached the victim and assaulted her, causing her to fall to the ground the suspect and victim were not known to each other  Through investigation, members of 32 Division were able to identify the accused as Jermaine Crooks, 39, of Toronto. On Tuesday, February 6, 2024, he was arrested and charged with:  Assault  He was scheduled to appear at the Toronto Regional Bail Centre, 2201 Finch Avenue West, on Tuesday, February 6, 2024, at 10 a.m., in room 106. Anyone with information is asked to contact police at 416-808-3200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 42": {
        "Four Men Arrested in Eight Separate Retail Robberies, Toronto Area, Video released": " The Toronto Police Service is making the public aware of arrests made in a retail Robbery investigation. Between Thursday, January 18, 2024 and Friday, February 2, 2024, police responded to eight separate Robbery calls throughout the City of Toronto. It is alleged that:  four males would enter a store while wearing masks to disguise their identities while inside, they indicated they were armed with a weapon, and demanded money during one of the incidents, one suspect brandished a firearm the men took a quantity of money and cigarettes before fleeing the scene  Members of the Hold Up Squad commenced an investigation. Shortly after the last robbery on Friday, February 2, officers from 23 Division located all four suspects and took them into custody. Suliman Rahimi, 22, of Toronto, has been arrested and charged with:  Robbery with a Firearm six counts Robbery seven counts Disguise with Intent five counts Possession of Property Obtained by Crime  Khalid Shikeb, 21, of Toronto, has been arrested and charged with:  Robbery with a Firearm five counts Robbery six counts Disguise with Intent five counts Possession of Property Obtained by Crime  Bilal Aria, 18, of Toronto, has been charged with:  Robbery With Firearm six counts of Robbery Weapons Dangerous five counts of Disguise With Intent five counts of Possession Property Obtained by Crime Under  Edrees Habibi, 18, of Ajax, has been charged with:  Robbery With Firearm seven counts of Robbery eight counts of Disguise With Intent five counts of Possession Property Obtained by Crime Under  Video can be viewed here They were scheduled to appear in court at the Toronto Regional Bail Centre, 2201 Finch Avenue West, on Friday, February 2, 2024, at 10 a.m., in room 106. Police are asking local residents, business and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-7350, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com.   "
    },
    "Case 43": {
        "Personal Injury Collision #8/2024, Martin grove Road and Westhumber Boulevard area": " On Sunday, February 4, 2024, at approximately 6:27 a.m., police responded to a personal injury collision in the Martin Grove Road and Westhumber Boulevard area. It is reported that:  a 19-year-old man was operating a silver 2022 Nissan Rogue northbound on Martin Grove Road the vehicle left the roadway and collided with a tree a 20-year-old male passenger in the vehicle was airlifted to a trauma centre where he remains in life-threatening condition the driver was also transported to hospital with non-life-threatening injuries  The investigation is ongoing by members of Traffic Services. Police are asking local residents, business and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 44": {
        "Personal Injury Collision #7/2024, Pharmacy Avenue and Janet Boulevard area": " On Saturday, February 3, 2024, at approximately 6:40 p.m., police responded to a personal injury collision in the Pharmacy Avenue and Janet Boulevard area. It is reported that:  a  58-year-old male cyclist was travelling southbound on Pharmacy Avenue in the west crosswalk a 78-year-old man was driving a white Ram Promaster van travelling northbound on Pharmacy Avenue  the Ram made a left turn on to Janet Boulevard and collided with the cyclist in the crosswalk the cyclist was transported to hospital with life-threatening injuries the driver remained on scene  The investigation is ongoing by members of Traffic Services. Police are asking local residents, business and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 45": {
        "Personal Injury Collision #4/2024, McNicoll Avenue and Brimley Road, Now Fatal Collision #3/2024": " On Monday, January 29, 2024 at approximately 1:45 p.m. police responded to a call for personal injury collision in the McNicoll Avenue and Brimley Road area. It is reported that:  the driver of a 2010 Nissan Sentra was travelling westbound on McNicoll Avenue at Brimley Road the driver the Nissan was making a left turn on Brimley Road a 60-year-old woman cyclist was travelling eastbound on McNicoll Avenue the driver of the Nissan struck the cyclist  the woman was transported to hospital with life-threatening injuries the driver remained on scene  See previous release. On Saturday, February 3, 2024, the cyclist sucumbed to their injuries. The investigation is ongoing by members of Traffic Services. Police are asking witnesses and residences, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 46": {
        "Personal Injury Collision #6/2024, Finch Avenue East and Willowdale Avenue area": " On Saturday, February 3, 2024, at approximately 8:30 a.m., police responded to a personal injury collision involving a pedestrian in the Finch Avenue East and Willowdale Avenue area. It is reported that:  a 29-year-old man was operating a 2022 Mercedes Sprinter Van, travelling southbound on Willowdale Avenue the Mercedes made a left hand turn to travel eastbound on Finch Avenue East a 78-year-old man was crossing from the southeast corner to the northeast corner on Willowdale Avenue as the vehicle made the turn, it struck the pedestrian the pedestrian was transported to hospital with life-threatening injuries   The investigation is ongoing by members of Traffic Services. Police are asking local residents, business and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 48": {
        "Man Arrested in Stabbing Investigation, Don Valley Drive and Hillside Drive area": " The Toronto Police Service is making the public aware of an arrest made in a Stabbing investigation. On Thursday, February 1, 2024, at approximately 7:12 p.m., police responded to a call for a Person with a Knife in the Don Valley Drive and Hillside Drive area. It is alleged that:  the victim and suspect got into an physical altercation the accused then brandished a knife the victim was stabbed several times the victim was transported to hospital where he remains in life-threatening condition  Bassanio Bartley, 48, of Toronto, has been arrested and charged with:  Assault with a Weapon Attempt Murder Aggravated Assault  He appeared in court at Toronto Regional Bail Centre, 2201 Finch Avenue West, on Friday, February 2, 2024, at 10 a.m., in room 106. Anyone with information is asked to contact police at 416-808-5500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 50": {
        "Woman Arrested for Assaulting a Toronto Police Parking Enforcement Officer, Yonge Street and Park Home Avenue area": " The Toronto Police Service is making the public aware of an arrest made in an Assault investigation. On Friday, January 26, 2024, at 4:45 p.m., police responded to a call in the Yonge Street and Park Home Avenue area. It is alleged that:  a Parking Enforcement Officer (PEO) was enforcing rush hour routes in the area the officer parked their vehicle behind the accused and alerted the driver to move by honking their horn the driver of the vehicle did not move the officer issued a parking ticket to the driver the driver exited the vehicle and became verbally abusive and assaulted the officer the driver then prevented the officer from accessing their vehicle police attended, conducted an investigation and the driver was arrested  Sahar Abbaszadeh, 41, of Richmond Hill was arrested and charged with:  Assault Peace Officer  She is scheduled to appear at The Ontario Court of Justice, on Monday, March 11, 2024, at 2 p.m., in Room 201. Anyone with information is asked to contact police at 416-808-1600, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 51": {
        "Man Arrested for Assaulting a Toronto Police Parking Enforcement Officer, Bloor Street West and Balmuto Street area": " The Toronto Police Service is making the public aware of an arrest made in an Assault investigation. On Friday, January 26, 2024, at 2:15 p.m., police responded to a call in the Bloor Street West and Balmuto Street area. It is alleged that:  a Parking Enforcement Officer (PEO) was enforcing the No Stopping By-law in the area the driver exited their vehicle and became verbally abusive towards the officer the driver then assaulted the officer and knocked the handheld ticket device from their hand the driver picked up the handheld device and threw it on the sidewalk damaging it police attended and conducted an investigation and the driver was arrested  Kevin Christopher Jemmott, 37, of Oshawa, was arrested and charged with:  Assault Peace Officer Mischief/Damage to Property not exceeding $5000  He is scheduled to appear at The Ontario Court of Justice, on Thursday, March 21, 2024, at 2 p.m., in room 202. Anyone with information is asked to contact police at 416-808-1600, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 52": {
        "Man Arrested for Assaulting a Toronto Police Parking Enforcement Officer, Soudan Avenue and Dunfield Avenue area": " The Toronto Police Service is making the public aware of an arrest made in an Assault investigation. On Monday, January 29, 2024, at approximately 4:30 p.m., police received a call for an assault in the Soudan Avenue and Dunfield Avenue area.  It is alleged that:  a Parking Enforcement Officer (PEO) was conducting enforcement in the area the officer was issuing a parking violation notice to a vehicle the driver approached the officer and became verbally abusive the driver made threats of bodily harm towards the officer the driver then stomped on the officer’s foot police attended, conducted an investigation and a quantity of drugs was located on the driver the driver was arrested  Steven Bulut, 54, of Mississauga, has been arrested and charged with:  Assault Peace Officer Utter Threat of Bodily Harm Possession of a scheduled substance for the purpose of trafficking  He is scheduled to appear at The Ontario Court of Justice, 10 Armoury Street, on Thursday, February 27, 2024, at 2 p.m., in room 202. Anyone with information is asked to contact police at 416-808-1600, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 53": {
        "Fatal Collision #2/2024, Jane Street and Clair Road area": " The Toronto Police Service is requesting the public’s assistance with an investigation into a fatal motor vehicle collision. On Thursday, February 1, 2024, at approximately 7:00 p.m., police received a report of a personal injury collision involving a vehicle and a pedestrian in the  Jane Street and Clair Road area. It is reported that:  a 53 year old male was operating a motor vehicle, a 2019 Toyota C-HR, southbound on Jane Street at Clair Road a 70 year old male pedestrian was crossing Jane Street on the north side of the intersection the Toyota C-HR struck the pedestrian causing significant injuries the pedestrian was taken to hospital where he was later pronounced deceased the driver remained on scene  The investigation is ongoing by members of Traffic Services. Police are asking local residents, businesses, and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 54": {
        "Two Youths Arrested in Theft of Vehicle and Abduction Investigation, Weston Road and Lawrence Avenue West area": " The Toronto Police Service is making the public aware of an arrest made in a Theft of Vehicle and Abduction investigation. On Thursday, February 1, 2024, at 3:31 p.m., police responded to a call for a stolen vehicle in the Weston Road and Lawrence Avenue West area. It is alleged that:  the victim briefly exited their vehicle, which was running, with their two children aged four and seven months inside the 13-year-old suspect jumped into the vehicle and drove away, picking up the second suspect a short distance away officers were immediately dispatched and located the vehicle the suspects abandoned the vehicle and attempted to flee on foot after a foot pursuit, both suspects were located and arrested  One child inside the vehicle suffered minor injuries and was transported to hospital, where they were treated and released. A male youth, 13*, of Toronto, is charged with:           Theft of a Motor Vehicle Abduct Person Under Sixteen Years Dangerous Operation of a Motor Vehicle Possession of Property Obtained by Crime / Exceeding $5000 Drive motor vehicle no valid license  A male youth, 16*, of Toronto, is charged with:  Theft of a Motor Vehicle Abduct Person Under Sixteen Years Possession of Property Obtained by Crime / Exceeding $5000 Theft Not Exceeding $5000 Possess of Property or Thing Obtained by Crime / Not Exceeding $5000 Possess/Use Credit Card Obtained by Offence   This youth was also charged in relation to outstanding warrant for:  Robbery Possession of Property obtained by Crime  Both suspects were scheduled to appear at the Ontario Court of Justice,10 Armoury Street, on Friday, February 2, 2024, at 10 a.m., in room 606. Anyone with information is asked to contact police at 416-808-1200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. **Please refer to Section 110, Subsection 1, of the YCJA: 110. (1) Subject to this section, no person shall publish the name of a young person, or any other information related to a young person, if it would identify the young person as a young person dealt with under this Act.*** "
    },
    "Case 55": {
        "Male Suspects wanted in a Break and Enter Investigation, Lakeshore Boulevard West and Rees Street area": " The Toronto Police Service is requesting the public’s assistance with a Break and Enter investigation. On Monday, January 15, 2024, police responded to a call for a break and enter in the Lakeshore Boulevard West and Rees Street area. It is reported that:  on January 13 and January 14, 2024, a group of eight suspects gained entry into an electrical station four different vehicles were used over the two days to obtain stolen property approximately $300,000 worth of industrial copper cable was taken  The eight male suspects are wanted for:  Break and Enter Theft over $5,000  Images have been released. Police are asking local residents, business and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-5200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 56": {
        "Man Arrested in Homicide Investigation 53/2023, Yonge Street and Hendon Avenue area, Update": " The Toronto Police Service is updating the public on a Homicide investigation.  See excerpt of previous news release published on Monday, September 25, 2023: -- On Sunday, September 24, 2023 at approximately 9:55 p.m. police responded to a call for a Stabbing in the Yonge Street and Hendon Avenue area. It is reported that:  a man was stabbed and laying in the southbound curb lane on Yonge Street at Hendon Avenue   officers arrived on scene and located the man the man was transported to hospital, where he succumbed to his injuries  The victim has been identified as Joyous Magdirila, 23, of Toronto. -- On Thursday, September 28, a youth* was arrested and charged with:  Second Degree Murder  They were scheduled to appear in court at the Ontario Court of Justice, 10 Armoury Street, on Friday, September 29, 2023, at 10 a.m., in room 606. On Thursday, February 1, 2024, Victor Bueron, 21, of Toronto was arrested and charged with:  Second Degree Murder  He is scheduled to appear in court at the Toronto Regional Bail Court, 2201 Finch Avenue East, on Friday, February 2, 2024, at 10 a.m., in room 105. Anyone with information is asked to contact police at 416-808-1200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. **Please refer to Section 110, Subsection 1, of the YCJA: 110. (1) Subject to this section, no person shall publish the name of a young person, or any other information related to a young person, if it would identify the young person as a young person dealt with under this Act.*** "
    },
    "Case 57": {
        "Man Sought in Suspected Hate-Motivated Threatening Investigation, Bathurst Street and Wilson Avenue area, Images released": " The Toronto Police Service is requesting the public's assistance identifying a man wanted in a suspected hate-motivated Threatening investigation. It is reported that:  on Saturday, December 16, 2023, the victim was operating a TTC bus in the Bathurst Street and Wilson Avenue area a man was on board disturbing other passengers the man threatened the victim while using racial slurs  The suspect is described as male, 5'7\", with a birthmark below his left eye. He was wearing a white toque, black jacket and black pants   Images have been released. Anyone with information is asked to contact police at 416-808-3500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. This investigation is being treated as a suspected hate-motivated offence. When suspected hate-motivated offences are reported to police, the investigation could be led by a Divisional investigator with the support of the Hate Crime Unit (HCU), or in some cases, will be investigated exclusively by the HCU. If it is alleged a criminal offence was committed (such as assault or mischief) and it is believed to have been motivated by bias, prejudice or hate, the officer-in-charge may consult with the Crown. If a person is charged and convicted of the offence, the Judge will take into consideration hate as an aggravating factor when imposing a sentence. Wilful promotion of hatred and advocating genocide are hate propaganda (hate speech) offences which require the Attorney General’s consent to lay charges. These charges are often laid at a later time. "
    },
    "Case 59": {
        "Man Sought in an Assault with a Weapon investigation, University Avenue and King Street West area, Image Released": " The Toronto Police Service is requesting the public’s assistance identifying a man wanted in an Assault with a Weapon investigation. On Wednesday, January 31, 2024, at approximately 3 p.m., a 17-year old youth was assaulted in the University Avenue and King Street West area. It is reported that:  the victim and suspect were both onboard the subway, traveling southbound from Museum station the suspect struck the victim in the face with an object the suspect and victim were not known to each other the suspect was last seen fleeing St. Andrew station   The man is described as 20-25 years old, with short dark hair, and a short beard. He was wearing a green puffy winter coat, with a black and green hooded sweater, and beige pants with black laced shoes. An image has been released. Anyone with information is asked to contact police at 416-808-5200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 60": {
        "Four Suspects Wanted in Retail Robbery Investigation, Dufferin Street and Yorkdale Road area, Images Released": " The Toronto Police Service Hold Up Squad is requesting the public’s assistance identifying four suspects in a Retail Robbery investigation. On Wednesday, January 31, 2024, at approximately 8:44 p.m., officers responded to a call for a robbery in the Dufferin Street and Yorkdale Road area. It is reported that:  four suspects entered a jewellery store within the mall one suspect produced a handgun and pointed it at employees the other suspects began smashing the glass display cases with hammers a quantity of jewellery and cash was obtained the four suspects fled in a vehicle  Members of the Hold Up Squad have commenced an investigation and are looking to identify the suspects. The four male suspects are described as approximately 5’8”, all having slim builds and wearing masks, gloves, and dark clothing.  The vehicle used by the suspects is described as a newer model grey SUV. Images have been released. If located, do not approach, and call 9-1-1 immediately. Police are asking local residents, business and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-7350, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 61": {
        "Man Arrested in Home Invasion Investigation, Twyford Road and Abilene Drive area": " The Toronto Police Service is making the public aware of an arrest made in a home invasion investigation. On Friday, December 8, 2023 at 4:55 a.m. police responded to a call for a break and enter in the Twyford Road and Abilene Drive area. It is alleged that:  two men forced their way into a residence and confronted the victim the men were brandishing crowbars and demanded keys to the victim's vehicle the men stole the vehicle and were last seen driving southbound on Twyford Road  On Thursday, January 25, 2025, members of the Provincial Carjacking Joint Task Force, with the assistance of York Regional Police, arrested Husnain Javed,19, of Toronto. He has been charged with:  Conspiracy to Commit an Indictable Offence Robbery with an Offensive Weapon Break and Enter Commit an Indictable Offence Possession of Property Obtained by Crime Over $5000  He was scheduled to appear in court at the Ontario Court of Justice, 2201 Finch Avenue West, on Wednesday, January 31, 2024, at 10 a.m., in room 107. Anyone with information is asked to contact police at 416-808-7350, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. About the Provincial Carjacking Joint Task Force (PCJTF) As a result of the rising incidents of violence related to auto crimes across the Greater Toronto Area (GTA), local police services have combined resources and established a Provincial Carjacking Joint Task Force (PCJTF) to further co-ordinate law enforcement efforts in combating these crimes. This collaborative approach aims to disrupt the networks responsible for violent and high-risk auto thefts and maximize enforcement efforts against criminal organizations. Co-led by the Toronto Police Service and the Ontario Provincial Police, the task force is a collaboration between police services from across the GTA, including York Regional Police, Halton Regional Police Service, Durham Regional Police Service, Peel Regional Police, and other external agencies, including Criminal Intelligence Service of Ontario. Click here for more information about the PCJTF. "
    },
    "Case 62": {
        "Man Arrested for Aggravated Assault and Assault with a Weapon, Yonge Street and Dundas Street West area": " The Toronto Police Service is making the public aware of an arrest in an Aggravated Assault and Assault with a Weapon investigation. On Tuesday, January 30, 2024, at approximately 3 p.m., police responded to a call for an Assault in the Yonge Street and Dundas Street West area. It is alleged that:  a man approached the victim from behind the man stabbed the victim with a syringe the man fled and was last seen entering the subway at Yonge Street and Dundas Street West the suspect and victim were not known to each other the victim was taken to hospital  See previous news release On Wednesday, January 31, 2024, Aaron Chomenchuck, 43, of no fixed address, was arrested and charged with:  Aggravated Assault Assault with a Weapon Fail to Comply with Release Order  He was scheduled to appear in court at the Ontario Court of Justice, 2201 Finch Avenue West, on Wednesday, January 31, 2024, at 10 a.m., in room 301. Anyone with information is asked to contact police at 416-808-5200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 64": {
        "Man wanted in Aggravated Assault and Assault with a Weapon investigation, College Street and Ossington Avenue area, Image released": " The Toronto Police Service is requesting the public’s assistance locating a man wanted in an Aggravated Assault and Assault with a Weapon investigation. On Friday, November 17, 2023, at approximately 6 a.m., police responded to a call for a stabbing in the College Street and Ossington Avenue area. It is alleged that:  a physical altercation occurred between two men one of the men produced a knife and stabbed the victim the man fled the area prior to police arrival the suspect and the victim are known to each other the victim was taken to hospital  The suspect has been identified as Abdirahman Ahmed, 23, of no fixed address. He is wanted for:  Aggravated Assault Assault with a Weapon Disobey Lawful Order of the Court  He is described as approximately 6’0\", has a thin build and black hair. An image has been released. If located, do not approach and call 9-1-1 immediately. Anyone with information is asked to contact police at 416-808-1400, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 65": {
        "Four Suspects Sought in Attempted Break and Enter Investigation, Queen Street East and Victoria Park Avenue area, Update, Video released": " The Toronto Police Service is updating the public on an attempted break and enter investigation. On Tuesday, January 30, 2024, at 3:55 a.m., police responded to a call for a break and enter in progress in the Queen Street East and Victoria Park Avenue area. See previous release. Investigators have released security camera video, it can be viewed on YouTube. Anyone with information is asked to contact police at 416-808-5500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 66": {
        "Man Arrested in Home Invasion Robbery Investigation, Kipling Avenue & Evans Avenue area": " The Toronto Police Service is making the public aware of an arrest made in a Home Invasion Robbery investigation. On Sunday, January 14, 2024, at approximately 9:40 a.m., officers responded to a person with a gun call in the Kipling Avenue and Evans Avenue area. It is alleged that:  the accused knocked on the door of a residence when the victim answered the door, the accused produced a handgun and pointed it at the victim’s chest the accused then forced his way into the residence while making a demand for cash the victim was able to exit the residence and escape the scene the accused fled empty-handed to a waiting vehicle and drove away from the area  On Tuesday, January 30, 2024, members of the Hold Up Squad, with the assistance of the Niagara Regional Police and the Peel Regional Police, executed two Criminal Code search warrants.  It is further alleged that:  officers recovered items of evidentiary value related to the investigation  James Waylon Maxwell, 40, of Niagara, was arrested and charged with:  Robbery With Firearm Possession Prohibited Device two counts of Fail to Comply With Release Order Possession Schedule I Substance for the Purpose of Trafficking  He was scheduled to appear in court at the Toronto Regional Bail Centre, 2201 Finch Avenue West, on Wednesday, January 31, 2024, at 10 a.m., at Room 402. Anyone with information is asked to contact police at 416-808-7350, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 68": {
        "Man Wanted For Aggravated Assault and Assault with a Weapon, Yonge Street and Dundas Street West area, Image Released": " The Toronto Police Service is requesting the public’s assistance locating a man wanted in an Aggravated Assault and Assault with a Weapon investigation. On Tuesday, January 30, 2024, at approximately 3 p.m., police responded to a call for an Assault in the Yonge Street and Dundas Street West area. It is alleged that:  a man approached the victim from behind the man stabbed the victim with a syringe the man fled and was last seen entering the subway at Yonge Street and Dundas Street West the suspect and victim were not known to each other the victim was taken to hospital  The suspect has been identified as Aaron Chomenchuck, 43, of no fixed address. He is wanted for:  Aggravated Assault Assault with a Weapon  Chomenchuck has short dark hair and a beard. He was last seen wearing a dark coloured hooded sweater, orange pants, and brown shoes. An image has been released. If located, do not approach and call 9-1-1 immediately. Anyone with information is asked to contact police at 416-808-5200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 69": {
        "Four Suspects Sought in Attempted Break and Enter Investigation, Queen Street East and Victoria Park Avenue area, Images Released": " The Toronto Police Service is requesting the public’s assistance with identifying four suspected in an attempted break and enter investigation. On Tuesday, January 30, 2024, at 3:55 a.m., police responded to a call for a break and enter in progress in the Queen Street East and Victoria Park Avenue area. It is reported that:  four men attempted to gain access into a residence after several failed attempts, they fled the area in a dark coloured vehicle the vehicle was last seen travelling eastbound on Queen Street East  The men are described as: Suspect #1: Male, between 20-25-years-old, wearing a red jacket, gray hooded sweater, gray pants, black shoes and a black face covering Suspect #2: Male, between 20-25-years-old, wearing glasses, a black jacket, a dark coloured sweater, black pants, black shoes and black balaclava Suspect #3: Male, between 20-25-years-old, wearing a black hooded sweater, black pants, black shoes and black mask Suspect #4: Male, between 20-25-years-old, wearing a black hooded sweater, gray pants, red gloves, black shoes and blue medical mask Images have been released. Anyone with information is asked to contact police at 416-808-5500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 71": {
        "Man Wanted For Aggravated Assault, Queen Street East and Pape Avenue area, Image released": " The Toronto Police Service is requesting the public's assistance locating a man wanted in an Aggravated Assault investigation. On Monday, January 29, 2024, at approximately 3:35 a.m. police responded to a call for Wounding in the Queen Street East and Pape Avenue area. It is alleged that:  there was an altercation between two men who were known to each other the suspect assaulted the victim  The suspect has been identified as Daniel Titus, 37, of no fixed address. He is wanted for:  Aggravated Assault  The suspect is described as having salt and pepper hair in a brush cut. He was wearing a grey hoodie with a large black Air Jordan Jumpman logo, blue jeans, black running shoes, and carrying a black backpack. An image has been released. Anyone with information is asked to contact police at 416-808-5500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 72": {
        "Personal Injury Collision #5/2024, Pedestrian Struck, Gerrard Street East and Broadview Avenue": " On Monday, January 29, 2024, at approximately 7 p.m., police received a report of a Personal Injury collision involving a pedestrian in an alleyway in the Gerrard Street East and Broadview Avenue area. It is reported that:  a 59-year-old man got out of his car to deliver an order while outside of his car, the car was set in motion and struck the man the man was taken to hospital with life-threatening injuries  The investigation is ongoing by members of Traffic Services. Police are asking local residents, business and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 74": {
        "Personal Injury Collision #4/2024, McNicoll Avenue and Brimley Road": " On Monday, January 29, 2024 at approximately 1:45 p.m. police responded to a call for personal injury collision in the McNicoll Avenue and Brimley Road area. It is reported that:  the driver of a 2010 Nissan Sentra was travelling westbound on McNicoll Avenue at Brimley Road the driver the Nissan was making a left turn on Brimley Road a 60-year-old woman cyclist was travelling eastbound on McNicoll Avenue the driver of the Nissan struck the cyclist  the woman was transported to hospital with life threatening injuries the driver remained on scene  The investigation is ongoing by members of Traffic Services. Police are asking local residents, business and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 75": {
        "Suspected Hate-Motivated Assault Investigation, St Clair Avenue East and O’Connor Drive area, Youth Arrested": " The Toronto Police Service is making the public aware of an arrest made in a suspected hate-motivated assault investigation. On Saturday, January 27, 2024, at approximately 2:30 a.m., Toronto Police received a call for an assault in the St Clair Avenue East and O’Connor Drive area. It is alleged that:  the victim works for a ride share company and was picking up a fare the victim cancelled the trip due to the passenger's behaviour the passenger then made anti-South Asian comments and assaulted the victim  On Monday, January 29, 2024, Toronto Police arrested a youth*, 16, of Toronto. She has been charged with:  Assault Fail to Comply with Judicial Order  She was scheduled to appear in court at the Ontario Court of Justice, 10 Armoury Street, on Monday, January 29, 2024 at 10 a.m., in room 606. This investigation is being treated as a suspected hate-motivated offence. Anyone with information is asked to contact police at 416-808-3500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. When suspected hate-motivated offences are reported to police, the investigation could be led by a Divisional investigator with the support of the Hate Crime Unit (HCU), or in some cases, will be investigated exclusively by the HCU. If it is alleged a criminal offence was committed (such as assault or mischief) and it is believed to have been motivated by bias, prejudice or hate, the officer-in-charge may consult with the Crown. If a person is charged and convicted of the offence, the Judge will take into consideration hate as an aggravating factor when imposing a sentence. Wilful promotion of hatred and advocating genocide are hate propaganda (hate speech) offences which require the Attorney General’s consent to lay charges. These charges are often laid at a later time. *Please refer to Section 110, Subsection 1, of the YCJA: 110. (1) Subject to this section, no person shall publish the name of a young person, or any other information related to a young person, if it would identify the young person as a young person dealt with under this Act.*** "
    },
    "Case 76": {
        "Suspected Hate-Motivated Mischief Investigation, Vaughan Road and Eglinton Avenue West area, Man Arrested": " The Toronto Police Service is making the public aware of an arrest made in a suspected hate-motivated Mischief investigation. On Monday, December 18, 2023, Toronto Police received a call for mischief in the Vaughan Road and Eglinton Avenue West area. It is alleged that:  a man was walking in the area the man vandalized the front steps of a Jewish school  On Friday, January 26, 2024, Ian Locke, 40, of Toronto, was arrested and charged with:  Mischief Interfere with Property  He is scheduled to appear in court at the Ontario Court of Justice, 10 Armoury Court, on Thursday, March 14, 2024, at 2 p.m., in room 202. This investigation is being treated as a suspected hate-motivated offence. Anyone with information is asked to contact police at 416-808-3500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. When suspected hate-motivated offences are reported to police, the investigation could be led by a Divisional investigator with the support of the Hate Crime Unit (HCU), or in some cases, will be investigated exclusively by the HCU. If it is alleged a criminal offence was committed (such as assault or mischief) and it is believed to have been motivated by bias, prejudice or hate, the officer-in-charge may consult with the Crown. If a person is charged and convicted of the offence, the Judge will take into consideration hate as an aggravating factor when imposing a sentence. Wilful promotion of hatred and advocating genocide are hate propaganda (hate speech) offences which require the Attorney General’s consent to lay charges. These charges are often laid at a later time. "
    },
    "Case 79": {
        "Woman and Man wanted in Robbery Investigation, Chester Subway Station": " The Toronto Police Service is making the public aware of a Robbery investigation. It is alleged that:  on Tuesday, January 23, 2024, at approximately 11:15 a.m., two teenage girls were onboard the subway, westbound on the Bloor/Danforth line two adults boarded the train at Coxwell Station the adults engaged the teens in a verbal dispute which then turned physical the adults then robbed one of the teens of her cellphone and assaulted her with the cellphone the adults left at Chester Station  The adults are each wanted for:  Robbery Assault with a Weapon Theft - Under ($5000)  The woman is described as 5'9\" with a medium build, missing teeth, long black hair in a ponytail sticking out of her hat.  She has a septum ring and dermal piercing on the cheekbone, and was wearing a checkered black and grey sweater, slush pants, black shoes, and was pulling a personal shopping cart. The man is described as 5'9\" with a heavy build, blue eyes, and stubbly beard.  He was wearing Blundstone boots, a yellow winter hat, and a black winter coat.   Anyone with information is asked to contact police at 416-808-5500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 80": {
        "Personal Injury Collision #3/2024, Eglinton Avenue West and Scarlett Road": " On Saturday, January 27, 2024, at 2:32 a.m., police responded to a report of a serious personal injury collision involving a motor vehicle in the Eglinton Avenue West and Scarlett Road area. It is reported that:  a 2012 Honda Civic was travelling at a high rate of speed westbound on Eglinton Avenue West the Honda was in the left lane as the right lane was under construction for reasons unknown, the driver lost control of the vehicle and collided into the concrete barrier of the construction zone two male passengers were taken to hospital with serious but non-life-threatening injuries one female passenger was taken to hospital with life-threatening injuries and remains in critical condition  The investigation is ongoing by members of Traffic Services. Police are asking residents, businesses and drivers who may have security or dash camera footage of the area or incident to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 82": {
        "Man arrested and four men sought in Aggravated Assault investigation, Queen Street West and Denison Avenue area, Images Released": " The Toronto Police Service is requesting the public’s assistance identifying suspects sought in an Aggravated Assault Investigation. On Sunday, November 19, 2023, at approximately 4:15 a.m., police responded to a call for an unknown trouble in the Queen Street West and Denison Avenue area. It is alleged that:  a group of five men approached the victims and assaulted them after a verbal altercation one of the suspects assaulted a victim with a firearm rendering him unconscious the group of men fled the area in an unknown direction  On Saturday, December 2, 2023, Nathaniel Wallis, 29, of Whitby, was arrested and charged with:  Possess Firearm Knowingly not Holding a Licence two counts of Point Firearm two counts of Assault with a Weapon Aggravated Assault two counts of Assault Cause Bodily Harm two counts of Breach of Probation three counts of Possess Firearm while Prohibited  He was scheduled to appear in court at the Ontario Court of Justice, 2201 Finch Avenue West, on Sunday, December 3, 2023, at 10 a.m., in room 105. The four outstanding male suspects are described as:  Suspect #1: muscular build, long hair worn in a bun, with a full beard Suspect #2: heavy build, light complexion, long hair worn in braids, with a full beard Suspect #3: medium build, short dark hair, with a short beard Suspect #4: medium build, short dark hair, with a thin goatee  Images have been released. Anyone with information is asked to contact police at 416-808-1400, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 83": {
        "Suspect Sought in Assault Investigation, Gerrard Street East and O'Keefe Lane area, Images Released": " The Toronto Police Service is requesting the public’s assistance identifying a suspect sought in an assault investigation. On Monday, January 15, 2024 at 5:54 p.m. police responded to a call for an assault just occurred in the Gerrard Street East and O'Keefe Lane area. It is reported that:  a man attempted to gain entry into a building the victim directed the man to leave the man assaulted the victim the man fled the area  The man is described as 5'10\", with curly black hair, a goatee and wearing glasses. Images have been released. Anyone with information is asked to contact police at 416-808-5100, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 84": {
        "Homicide #55/2023, Morningside Avenue and Danzig Street area, Joshua Bernard-Reis, 21, UPDATE": " The Toronto Police Service is updating the public on a homicide investigation.  See excerpt of previous news release published on October 9, 2023: -- On Sunday, September 24, 2023, at approximately 11:17 p.m., police responded to a call for a shooting in the Morningside Avenue and Danzig Street area. It is reported that:  police arrived on scene and located the victim suffering from gun shot wounds the victim was transported to hospital with life-threatening injuries on Sunday, October 8, 2023, the victim succumbed to his injuries  The victim has been identified as Joshua Bernard-Reis, 21, of Toronto. -- On Monday, November 6, 2023, Jermaine Goode, 19, of Markham, was arrested and charged with:  First Degree Murder  He appeared virtually at the Toronto Regional Bail Centre, 2201 Finch Avenue West, on Tuesday, November 7, 2023, at 10 a.m., in room 103.  On Thursday, January 25, 2024, the Toronto Police Service, with the assistance of Peel Regional Police, located, arrested and charged a male youth, 16*, with:  First Degree Murder Attempted Murder  He is scheduled to appear in court at the Ontario Youth Justice Court, 10 Armoury Street, on Friday, January 26, 2024, at 10 a.m., in room 606. *Please refer to Section 110, Subsection 1, of the YCJA: 110. (1) Subject to this section, no person shall publish the name of a young person, or any other information related to a young person, if it would identify the young person as a young person dealt with under this Act. "
    },
    "Case 85": {
        "Man Wanted in Suspected Hate-Motivated Robbery Investigation, Bloor Street West and Lansdowne Avenue area, Image released": " The Toronto Police Service is requesting the public’s assistance with a suspected hate-motivated robbery investigation. On Monday, January 22, 2024, at approximately 10:07 p.m., police responded to a call for a theft in the Bloor Street West and Lansdowne Avenue area. It is reported that:  an unknown male entered a convenience store the suspect proceeded to select several items, concealing them within his jacket the victim observed the suspect conceal one item and demanded that he return the item and was able to retrieve it the suspect continued walking towards the exit when the victim realized that the suspect had more items concealed in his jacket the victim again demanded that the suspect return the items the suspect made xenophobic remarks towards the victim before assaulting her the male fled the scene in an unknown direction  The man is described as male, 30-40 years old, medium build, brown hair, full beard. An image has been released. When suspected hate-motivated offences are reported to police, the investigation could be led by a Divisional investigator with the support of the Hate Crime Unit (HCU), or in some cases, will be investigated exclusively by the HCU. If it is alleged a criminal offence was committed (such as assault or mischief) and it is believed to have been motivated by bias, prejudice or hate, the officer-in-charge may consult with the Crown. If a person is charged and convicted of the offence, the Judge will take into consideration hate as an aggravating factor when imposing a sentence. Wilful promotion of hatred and advocating genocide are hate propaganda (hate speech) offences which require the Attorney General’s consent to lay charges. These charges are often laid at a later time. Anyone with information is asked to contact police at 416-808-3500, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 86": {
        "Suspect for Identification in Robbery Investigation, Bathurst Street and Steeles Avenue West area,": " The Toronto Police Service is requesting the public’s assistance identifying a suspect sought in a Robbery investigation. On Sunday, December 10, 2023, at approximately 9:30 p.m., police responded to a call for a robbery in the Bathurst Street and Steeles Avenue West area. It is reported that:  the suspect entered a commercial establishment, selected a variety of goods and made no attempt to pay uniformed store security attempted to arrest the suspect the suspect produced a knife and threatened store security he then fled the area on foot    The man is described as 5' to 5'5\", thin build, with short brown hair and a beard. He was last seen wearing black pants, black jacket, light coloured hoodie, and wearing a black and white winter hat with \"Canada\" on it. Images have been released. Anyone with information is asked to contact police at 416-808-3200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 87": {
        "Man Arrested in Robbery Investigation, Kennedy Road and Sheppard Avenue East area, Image Released": " The Toronto Police Service is notifying the public of an arrest made in a Robbery investigation. On Sunday, January 21, 2024, at approximately 12:05 a.m., police responded to a call for a Sexual Assault in the Kennedy Road and Sheppard Avenue East area. It is alleged that:  on Sunday, December 3, 2023, the victim met the accused on a social media platform the accused attended the victim's residence the accused then produced a weapon and bound the victim's hands the accused demanded money from the victim, and robbed her before fleeing  It is further alleged that:  on Wednesday, December 20, 2023, the accused entered the same victim's residence once inside, the accused refused to leave the accused demanded money from the victim the accused then fled the scene   On Tuesday, January 23, 2024, members of the Sex Crimes Unit executed a Criminal Code search warrant in the Bloor Street West and Spadina Road area, in relation to the investigation.  Benny Ning Zhang, 45, of Toronto, has been arrested and charged with:  Robbery Forcible Confinement Assault with a Weapon Threaten Death Extortion Unlawfully in a Dwelling Criminal Harassment Possession of a Schedule I Substance  He  appeared in court at the Toronto Regional Bail Centre, 2201 Finch Avenue West, on Tuesday, January 23, 2024, at 2 p.m., in room 105. Police believe there may be more victims.  Anyone with information is asked to contact police at 416-808-7474, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com.   "
    },
    "Case 88": {
        "Man Arrested for Damaging Vehicles, Jane Street and Wilson Avenue area": " The Toronto Police Service is making the public aware of an arrest made in a Damage to Auto investigation. It is alleged that:  between September 2023 and January 2024 a man attended the area of Jane Street and Wilson Avenue the man slashed several tires in the area with an edged weapon  On January 24, 2024, Abdifatah Adde, of Toronto, was arrested and charged with:  seven counts of Mischief under $5000 six counts of Carry Concealed Weapon six counts of Possession of a Dangerous Weapon  He attended court on Wednesday, January 24, 2024, at the Toronto Regional Bail Centre in room 105 at 10 a.m. Police believe more vehicles may have been damaged. If your vehicle was damaged in this area, please contact police. Anyone with information is asked to contact police at 416-808-3100, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 89": {
        "Male Youth arrested in Aggravated Assault Investigation, Finch Avenue West and Bathurst Street area": " The Toronto Police Service is making the public aware of an arrest made in an Aggravated Assault investigation. On Monday, January 22, 2024, at approximately 3:40 p.m., police responded to a person with a knife call in the Finch Avenue West and Bathurst Street area. It is alleged that:  the victim was standing in a parking lot with friends when the suspect started running towards him the victim attempted to run away but fell to the ground the suspect caught up to the victim and stabbed him several times the suspect then fled on foot in an unknown direction the victim sustained serious but non-life-threatening injuries  A male youth, 17*, of Toronto, has been arrested and charged with:  Aggravated Assault two counts of Assault with a Weapon Possession of a Weapon for a Dangerous Purpose  Disguise with Intent  He is scheduled to appear in court at the Ontario Court of Justice, 10 Armoury Street, on Wednesday, January 24, 2024, at 2 p.m., in room 606. Anyone with information is asked to contact police at 416-808-3200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. **Please refer to Section 110, Subsection 1, of the YCJA: 110. (1) Subject to this section, no person shall publish the name of a young person, or any other information related to a young person, if it would identify the young person as a young person dealt with under this Act.***   "
    },
    "Case 90": {
        "Man Arrested in Assault with a Weapon Investigation, Front Street West and Bay Street, Union Station": " The Toronto Police Service is making the public aware of an arrest made in an Assault with a Weapon investigation. On Monday, January 22, 2024, at approximately 8:28 p.m., police responded to a call for an Unknown Trouble in the Front Street West and Bay Street area. It is alleged that:  the accused got into a verbal altercation with the victim in Union Station  the accused then sprayed the victim with bear spray  the accused and victim fled the scene a number of people inside Union Station suffered effects from the bear spray  Myles Kuhlberg, 29, of Toronto, has been arrested and charged with:  Assault with a Weapon Possession of a Weapon Mischief/Interfere with Lawful use of Property  He appeared in court at the Toronto Regional Bail Centre, 2201 Finch Avenue West, on Tuesday, January 23, 2024, at 10 a.m., in room 301. Anyone with information is asked to contact police at 416-808-5200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 92": {
        "Man Arrested for Threatening a Toronto Police Parking Enforcement Officer, Jane Street and Bloor Street West Area": " The Toronto Police Service is making the public aware of an arrest made in an Uttering Threats investigation.  On Friday, January 12, 2024, at approximately 3 p.m., police responded to a call in the Jane Street and Bloor Street West area. It is alleged that:  a Parking Enforcement Officer (PEO) was conducting enforcement of bike lanes in the area and tagged the accused’s vehicle a man then exited a near-by business and confronted the officer the man became verbally abusive towards the officer the man then got into his vehicle and drove past the officer numerous times making threats the officer called for assistance, and the man was arrested nearby  Salman Pusat, 27, of Toronto, has been arrested and charged with:  Utter Threats/Death or Bodily Harm  He is scheduled to appear in court at the Ontario Court of Justice, 10 Armoury Street, on Friday, February 23, 2024, at 11 a.m., in room 203.   "
    },
    "Case 93": {
        "Man Arrested for Assaulting a Toronto Police Parking Enforcement Officer, Bleecker Street and Wellesley Street East Area": " The Toronto Police Service is making the public aware of an arrest made in an assault investigation. On Friday, January 19, 2024, at approximately 1 p.m., police responded to a call for an Assault in the Bleecker Street and Wellesley Street East area. It is alleged that:  a Parking Enforcement Officer (PEO) on bicycle patrol was conducting  enforcement in the area and tagged the accused vehicle in a Transit Stop a man exited a near-by building and began yelling at the officer the man then assaulted the officer and kicked their bicycle over causing damage the man then got into his vehicle and drove off police attended, stopped the vehicle nearby and the driver was arrested  Haluk Akbulut, 58, of Toronto, has been arrested and charged with:  Assault Peace Officer Mischief/Damage to Property not exceeding $5000  He is scheduled to appear in court at the Ontario Court of Justice, 10 Armoury Street, on Monday, February 26, 2024, at 11 a.m., in room 203.   "
    },
    "Case 94": {
        "Man Arrested for Assaulting a Toronto Police Parking Enforcement Officer, Flemington Road and Ranee Avenue": " The Toronto Police Service is making the public aware of an arrest made in an assault investigation.  On Sunday, January 14, 2024, at approximately 2:10 a.m., police responded to a call for an assault in the Flemington Road and Ranee Avenue area. It is alleged that:  a Parking Enforcement Officer was conducting enforcement in the area and tagged the accused’s vehicle a man then exited a near-by residence and confronted the officer the officer was returning to their marked patrol vehicle, when they were assaulted by the man the officer then called police for assistance, and the man was arrested   Serhii Nosyk, 33, of Mississauga, has been arrested and charged with:  Assault Peace Officer  He is scheduled to appear in court at the Ontario Court of Justice, 10 Armoury Street, on Thursday, February 29, 2024, at 2 p.m., in room 201.   "
    },
    "Case 95": {
        "Suspects Wanted in a Break and Enter Investigation, Bay Street and Wellesley Street West area, Update, Suspect Has Been Identified": " The Toronto Police Service is making the public aware of an update in a Break and Enter investigation. See excerpt of previous news release published on December 13, 2023: -- On Monday, December 11, 2023, at approximately 3:22 p.m., police responded to a call for Break and Enter in the Bay Street and Wellesley Street West area. It is reported that:  between Sunday, December 10, 2023, and Monday, December 11, 2023, a man entered into an underground parking garage of a building  while inside, the man gained entry into a storage locker  the man was seen entering and leaving the underground a number of times at one point, a second man attended the underground parking garage with the first man during that time frame, a number of items were taken from the storage locker, including two firearms the firearms stolen were a Winchester Model 94 Carbine 30-30 Leveler Action and a Remington Pump Action .22 Calibre  Suspect #1 is described as wearing blue jeans, dark shoes, a red and black Roots varsity jacket with the number \"98\" on the left arm and a Canadian Olympics logo, and a black vest. This man was also seen wearing a black jacket the first time he attended the building's underground. Suspect #2 is described as wearing dark pants, dark boots, a dark toque, a camouflage jacket, and carrying a bright red backpack with yellow cartoon characters on it. -- As an result of this investigation, officers were able to identify suspect #1 as Christopher Pouliot, 39, of Toronto.  He is wanted for:  Break Enter and Steal Firearm Break and Enter with Intent Possession of Firearm or Ammunition Contrary to Probation Order five counts of Break Enter and Commit Theft seven counts Fail to Comply Probation Order  The man is described as being 5'9\", 155 lbs., with a medium build, short brown hair and hazel eyes. Images have been released. Anyone with information is asked to contact police at 416-808-5200, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    },
    "Case 97": {
        "Fatal #1/2024, Lake Shore Boulevard East and Cherry Street": " On Saturday, January 20, 2024, at approximately 8:43 a.m., police responded to a report of a personal injury collision in the Lake Shore Boulevard East and Cherry Street area. It is reported that:  an 18-year-old male was operating a 2014 Jeep Grand Cherokee westbound on Lake Shore Boulevard East, west of Don Roadway a 32-year-old male was operating a 2023 Ford F150 eastbound on Lake Shore Boulevard East, east of Cherry Street the driver of the Jeep lost control, and struck the Ford as a result of this collision, the Jeep left the roadway and entered the Don River the driver of the Jeep was transported to hospital where he succumbed to his injuries  The investigation is ongoing by members of Traffic Services. Police are asking local residents, businesses, and drivers, who may have security or dash camera footage of the area or incident, to contact investigators. Anyone with information is asked to contact police at 416-808-1900, Crime Stoppers anonymously at 416-222-TIPS (8477), or at www.222tips.com. "
    }
}